// 1. Напишите программу, которая на вход принимает два
// числа и проверяет, является ли первое число квадратом
// второго.
// a = 25, b = 5 -> да
// a = 2, b = 10 -> нет
// a = 9, b = -3 -> да
// a = -3 b = 9 -> нConsole
// Console.Write("please enter number n1: ");
// num1 = int.Parse(Console.ReadLine()!);
// Console.Write("please enter number n2: ");
// num2 = int.Parse(Console.ReadLine()!);
// if((num2 * num2)==num1)
// {
// Console.Write("Yes ");
     
// }
// else
// {
// Console.Write("no! ");

// }


// string s_a = Console.ReadLine()!;
// string s_b = Console.ReadLine()!;

// int a = int.Parse(s_a);
// int b = int.Parse(s_b);

// if (a == b * b)
// {
//     Console.WriteLine("Yes");    
// }
// else
// {
//     Console.WriteLine("No");
// }



// 3. Напишите программу, которая будет выдавать
// название дня недели по заданному номеру.
// 3 -> Среда
// 5 -> Пятница
