//1. напишите программу которая на вход принимает число 
// и выдает его квадрат(число умноженное само на себя)
// Console.WriteLine("write a number: ");

// int num = int.Parse(Console.ReadLine()!); (!) //означает не беспокойся на счет пустой строки
// Console.WriteLine(num * num);     // parse -это преобразования из типа инт в интджер

// Console.WriteLine("Write a number: ");
// string s_a = Console.ReadLine();

// int a = int.Parse(s_a);
// // int a = int.Parse(Console.ReadLine());

// Console.WriteLine(a * a);